{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.5/4"
      ],
      "degree": "Post Graduate Diploma",
      "department": "Electronics Engineering",
      "duration": "2018-2020",
      "school_name": "Centennial College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HarikrishnaSPillai",
  "highlighted_projects": [
    {
      "description": "Designed and Developed a Parking Detection system in a Raspberry Pi and Intel Neural Compute Stick. The system used Yolo v3 Real-time Object detection algorithm to process images supplied by Pi cam. The number of parking spots was conveyed from Raspberry Pi to Firebase using Python and Web API. The data received in real-time was broadcast to the client-side web application. The web app was developed using Flutter and Dart programming language. Additionally, the web app used google authentication API and Map API for authentication and GUI purposes.",
      "git_url": null,
      "name": "Real-Time Parking Detection System"
    },
    {
      "description": "Developed a Responsive website using tech HTML/CSS/JS as front end stack. The back-end was configured using AWS services like S3 and route 53. www.analysthari.com -\u003e http://www.analysthari.com/",
      "git_url": null,
      "name": "Portfolio Website"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a monitoring agent using Bash scripts that keep an active track of resource usage statistics of a node in a network. Postgres container mounted on a Docker engine is used as a Database. SQL queries were used for data analysis which also includes an error detection query to check if crontab is updating values on a timely basis. The Bash Scripts are automated using crontab. The agent was run in a CentOS 7 virtual machine on the Google Cloud Platform.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": [
        "JDBC App: Worked on a Java application using JDBC API to connect to a PostgreSQL database. The app allows users to perform CRUD operations and is built using the DAO(Data Access Object) pattern. Maven is used as Project Management Tool.",
        "Grep App: Reimplemented the popular LINUX grep command as a Java App. The application recursively searches through a given directory for a supplied Regex pattern. The matched lines are then written in a text file. The application was improvised by Java 8 features Lambda and Stream API. Streams and Lambda helped in reducing memory usage and inducing a declarative programming approach. IntelliJ was used as IDE and the project was built using Maven. The app is deployed on DockerHub using Docker."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Harikrishna S Pillai",
  "others": [
    {
      "bullets": [
        "SQL- SQL for Data Analytics and Business Intelligence"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Reading Non-Fictional Books",
        "Building Projects with Arduino"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Practised Scrum framework for team collaboration and SDLC. Developed several application using technologies such as Docker, Bash scripting, Java, RDBMS(SQL), Project management using Maven and version control using Git/GitHub.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "BSC Global",
      "description": "Delivered quality reports on a biweekly basis using MS excel and Power BI to stakeholders to showcase the improvements made by the department. Prepared an informative dashboard for the logistics department which increased productivity by approximately 10 percent. Improvised the current SOP which increased the productivity by 25 percent with almost similar or decreased human effort.Test and Diagnose products with proper documentation to help organize inventory",
      "duration": "2020-2021",
      "title": "Product Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Flutter/Dart",
      "Objective C",
      "Firebase",
      "Assembly Language"
    ],
    "familiar": [
      "HTML/CSS",
      "MATLAB",
      "JavaScript",
      "Android Studio",
      "Node.js"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitHub",
      "IntelliJ",
      "Docker"
    ]
  },
  "summary": "A software enthusiast who is passionate about developing applications. During my academic years, I developed several projects using technologies like Flutter, Firebase, and Google APIs. Thereafter, pursuing a career in software became my prime focus. Recently, I started working at Jarvis as a Data Engineer. At Jarvis, our team used the Agile methodology which helped me align with industry-standard SDLC. Moreover, I was able to put my time-management, problem-solving and organizational skills to work by developing applications. Implementation of these applications helped me become proficient in technologies like Version Control, Java, Bash Scripting, RDBMS(SQL), Maven, Docker, JDBC, CLI. I aspire to deliver world-class applications along with pursuing my passion to learn new technologies."
}
